Benchmarks/media-streaming_plot_testing/parser_output/output_run_5/result3.log

Total: connections 522 requests 8495 replies 8473 test-duration 330.245 s
Number of connected connections is currently = 0

Connection rate: 1.6 conn/s (632.7 ms/conn, <=501 concurrent connections)
Connected connection rate: 1.6 conn/s (632.7 ms/conn, <=500 concurrent connected connections)
Connection time [ms]: min 10011.3 avg 124106.8 max 320693.0 median 99999.5 stddev 102038.9
Connection time [ms]: connect 0.1
Connection length [replies/conn]: 16.232

Response time (no timeouts) [ms]: 0.0
Response time (only timeouts) [ms]: 0.0
Response time (all) [ms]: 124106.8
Request rate: 25.7 req/s (38.9 ms/req)
Request size [B]: 139.0

Overall reply rate: 25.7 replies/sec
Reply rate [replies/s]: min 9.6 avg 25.7 max 200.0 stddev 34.0 (66 samples)
Reply time [ms]: response 1.7 transfer 4.1
Reply size [B]: header 294.0 content 2985306.0 footer 0.0 (total 2985600.0)
Reply status: 1xx=0 2xx=8473 3xx=0 4xx=0 5xx=0

CPU time [s]: user 2.26 system 29.20 (user 0.7% system 8.8% total 9.5%)
Net I/O: 74808.9 KB/s (612.8*10^6 bps)

Errors: total 22 client-timo 0 socket-timo 0 connrefused 0 connreset 22
Errors: fd-unavail 0 addrunavail 0 ftab-full 0 addrinuse 0 other 0
Unconnected timeouts 0 connected timeouts 0 total (0) client_timeouts 0


Session rate [sess/s]: min 0.00 avg 1.51 max 10.40 stddev 3.58 (500/500)
Session: avg 1.04 connections/session
Session lifetime [s]: 129.6
Session failtime [s]: 0.0
Session length histogram: 0 0 0 0 0 0 0 102 0 0 98 0 0 0 0 101 0 100 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 99